
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # cloudflare_record.dnsrecord_main will be created
  + resource "cloudflare_record" "dnsrecord_main" {
      + allow_overwrite = true
      + content         = (known after apply)
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "ide.zenpresscloudmail.xyz"
      + proxiable       = (known after apply)
      + proxied         = true
      + ttl             = 1
      + type            = "A"
      + value           = "34.0.204.117"
      + zone_id         = "f26b3505a59c262e7e3926eda9213dfd"
    }

  # cloudflare_ruleset.ruleset_cache will be created
  + resource "cloudflare_ruleset" "ruleset_cache" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "disable_cache_everything"
      + phase       = "http_request_cache_settings"
      + zone_id     = "f26b3505a59c262e7e3926eda9213dfd"

      + rules {
          + action      = "set_cache_settings"
          + description = "Soft disable cache (Terraform-safe)"
          + enabled     = true
          + expression  = "true"
          + id          = (known after apply)
          + ref         = (known after apply)

          + action_parameters {
              + cache = false
            }
        }
    }

  # cloudflare_ruleset.ruleset_waf will be created
  + resource "cloudflare_ruleset" "ruleset_waf" {
      + description = (known after apply)
      + id          = (known after apply)
      + kind        = "zone"
      + name        = "country-access-control"
      + phase       = "http_request_firewall_custom"
      + zone_id     = "f26b3505a59c262e7e3926eda9213dfd"

      + rules {
          + action      = "block"
          + description = "Block all non-allowed countries"
          + enabled     = true
          + expression  = "not ((ip.geoip.country eq \"ES\"))"
          + id          = (known after apply)
          + ref         = (known after apply)
        }
    }

  # cloudflare_zone_settings_override.zonesettings_main will be created
  + resource "cloudflare_zone_settings_override" "zonesettings_main" {
      + id                       = (known after apply)
      + initial_settings         = (known after apply)
      + initial_settings_read_at = (known after apply)
      + readonly_settings        = (known after apply)
      + zone_id                  = "f26b3505a59c262e7e3926eda9213dfd"
      + zone_status              = (known after apply)
      + zone_type                = (known after apply)

      + settings {
          + always_online               = (known after apply)
          + always_use_https            = "on"
          + automatic_https_rewrites    = "on"
          + binary_ast                  = (known after apply)
          + brotli                      = (known after apply)
          + browser_cache_ttl           = (known after apply)
          + browser_check               = (known after apply)
          + cache_level                 = (known after apply)
          + challenge_ttl               = (known after apply)
          + ciphers                     = (known after apply)
          + cname_flattening            = (known after apply)
          + development_mode            = (known after apply)
          + early_hints                 = (known after apply)
          + email_obfuscation           = (known after apply)
          + filter_logs_to_cloudflare   = (known after apply)
          + fonts                       = (known after apply)
          + h2_prioritization           = (known after apply)
          + hotlink_protection          = (known after apply)
          + http2                       = (known after apply)
          + http3                       = (known after apply)
          + image_resizing              = (known after apply)
          + ip_geolocation              = (known after apply)
          + ipv6                        = (known after apply)
          + log_to_cloudflare           = (known after apply)
          + max_upload                  = (known after apply)
          + min_tls_version             = "1.2"
          + mirage                      = (known after apply)
          + opportunistic_encryption    = (known after apply)
          + opportunistic_onion         = (known after apply)
          + orange_to_orange            = (known after apply)
          + origin_error_page_pass_thru = (known after apply)
          + origin_max_http_version     = (known after apply)
          + polish                      = (known after apply)
          + prefetch_preload            = (known after apply)
          + privacy_pass                = (known after apply)
          + proxy_read_timeout          = (known after apply)
          + pseudo_ipv4                 = (known after apply)
          + replace_insecure_js         = (known after apply)
          + response_buffering          = (known after apply)
          + rocket_loader               = (known after apply)
          + security_level              = (known after apply)
          + server_side_exclude         = (known after apply)
          + sort_query_string_for_cache = (known after apply)
          + speed_brain                 = (known after apply)
          + ssl                         = "full"
          + ssl_automatic_mode          = (known after apply)
          + tls_1_2_only                = (known after apply)
          + tls_1_3                     = (known after apply)
          + tls_client_auth             = (known after apply)
          + true_client_ip_header       = (known after apply)
          + universal_ssl               = (known after apply)
          + visitor_ip                  = (known after apply)
          + waf                         = (known after apply)
          + webp                        = (known after apply)
          + websockets                  = (known after apply)
          + zero_rtt                    = (known after apply)

          + aegis (known after apply)

          + minify (known after apply)

          + mobile_redirect (known after apply)

          + nel (known after apply)

          + security_header (known after apply)
        }
    }

  # google_compute_firewall.allow_temp_ssh will be destroyed
  # (because google_compute_firewall.allow_temp_ssh is not in configuration)
  - resource "google_compute_firewall" "allow_temp_ssh" {
      - creation_timestamp      = "2025-11-25T03:49:28.015-08:00" -> null
      - destination_ranges      = [] -> null
      - direction               = "INGRESS" -> null
      - disabled                = true -> null
      - id                      = "projects/sinuous-env-479311-m1/global/firewalls/zenpresscloudmail-ide-firewall-tempssh" -> null
      - name                    = "zenpresscloudmail-ide-firewall-tempssh" -> null
      - network                 = "https://www.googleapis.com/compute/v1/projects/sinuous-env-479311-m1/global/networks/default" -> null
      - priority                = 1000 -> null
      - project                 = "sinuous-env-479311-m1" -> null
      - self_link               = "https://www.googleapis.com/compute/v1/projects/sinuous-env-479311-m1/global/firewalls/zenpresscloudmail-ide-firewall-tempssh" -> null
      - source_ranges           = [
          - "0.0.0.0/0",
        ] -> null
      - source_service_accounts = [] -> null
      - source_tags             = [] -> null
      - target_service_accounts = [] -> null
      - target_tags             = [
          - "zenpresscloudmail-ide-instance-main",
        ] -> null
        # (1 unchanged attribute hidden)

      - allow {
          - ports    = [
              - "22",
            ] -> null
          - protocol = "tcp" -> null
        }
    }

  # google_compute_firewall.fw_tempssh will be created
  + resource "google_compute_firewall" "fw_tempssh" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = "INGRESS"
      + disabled           = true
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "zenpresscloudmail-ide-firewall-tempssh"
      + network            = "default"
      + priority           = 1000
      + project            = "sinuous-env-479311-m1"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "0.0.0.0/0",
        ]
      + target_tags        = [
          + "zenpresscloudmail-ide-instance-main",
        ]

      + allow {
          + ports    = [
              + "22",
            ]
          + protocol = "tcp"
        }
    }

  # local_file.file_pem_ssh will be created
  + resource "local_file" "file_pem_ssh" {
      + content              = (sensitive value)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0600"
      + filename             = "/tmp/pem_ssh"
      + id                   = (known after apply)
    }

  # null_resource.null_ansible_install will be created
  + resource "null_resource" "null_ansible_install" {
      + id       = (known after apply)
      + triggers = {
          + "instance_id"   = "projects/sinuous-env-479311-m1/zones/europe-southwest1-b/instances/zenpresscloudmail-ide-instance-main"
          + "playbook_hash" = "30bc6fb5391b64d9e832f63860ac3c8fbcee5d736dbb03a9977805998db60cb6"
        }
    }

  # null_resource.run_ansible will be destroyed
  # (because null_resource.run_ansible is not in configuration)
  - resource "null_resource" "run_ansible" {
      - id       = "1774592498144994026" -> null
      - triggers = {
          - "playbook_hash" = "f8c48d3576fb992e353fa231b998571b554016a3e8af0d05bc7711ffc0a13583"
        } -> null
    }

Plan: 7 to add, 0 to change, 2 to destroy.
